<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.145">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _159 _160 _161 _162 _163 _164 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _199 _200 _201 _202 _203 _204 _205 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _216 _217 _218 _219 _220 _221 _222 _223 _224 _225 _226 _227 _228 _229 _230 _231 _232 _233 _234 _235 _236 _237 _238 _239 _240 _241 _242 _243"/>
  <Typedef id="_2" name="__int128_t" type="_244" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_245" context="_1" location="f0:0" file="f0" line="0"/>

  <Function id="_223" name="strncasecmp" returns="_256" context="_1" location="f16:120" file="f16" line="120" extern="1" artificial="1" mangled="_Z11strncasecmp">
    <Argument type="_249"/>
    <Argument type="_249"/>
    <Argument type="_250"/>
  </Function>
  <Function id="_224" name="strcasecmp_l" returns="_256" context="_1" location="f16:128" file="f16" line="128" extern="1" mangled="_Z12strcasecmp_l">
    <Argument name="__s1" type="_249" location="f16:128" file="f16" line="128"/>
    <Argument name="__s2" type="_249" location="f16:128" file="f16" line="128"/>
    <Argument name="__loc" type="_195" location="f16:128" file="f16" line="128"/>
  </Function>
  <Function id="_225" name="strncasecmp_l" returns="_256" context="_1" location="f16:133" file="f16" line="133" extern="1" mangled="_Z13strncasecmp_l">
    <Argument name="__s1" type="_249" location="f16:133" file="f16" line="133"/>
    <Argument name="__s2" type="_249" location="f16:133" file="f16" line="133"/>
    <Argument name="__n" type="_8" location="f16:134" file="f16" line="134"/>
    <Argument name="__loc" type="_195" location="f16:134" file="f16" line="134"/>
  </Function>
  <Function id="_226" name="explicit_bzero" returns="_296" context="_1" location="f13:435" file="f13" line="435" extern="1" mangled="_Z14explicit_bzero">
    <Argument name="__s" type="_259" location="f13:435" file="f13" line="435"/>
    <Argument name="__n" type="_8" location="f13:435" file="f13" line="435"/>
  </Function>
  <Function id="_227" name="strsep" returns="_247" context="_1" location="f13:439" file="f13" line="439" extern="1" mangled="_Z6strsep">
    <Argument name="__stringp" type="_298r" location="f13:439" file="f13" line="439"/>
    <Argument name="__delim" type="_249r" location="f13:440" file="f13" line="440"/>
  </Function>
  <Function id="_228" name="strsignal" returns="_247" context="_1" location="f13:446" file="f13" line="446" extern="1" mangled="_Z9strsignal">
    <Argument name="__sig" type="_256" location="f13:446" file="f13" line="446"/>
  </Function>
  <Function id="_229" name="__stpcpy" returns="_247" context="_1" location="f13:449" file="f13" line="449" extern="1" mangled="_Z8__stpcpy">
    <Argument name="__dest" type="_247r" location="f13:449" file="f13" line="449"/>
    <Argument name="__src" type="_249r" location="f13:449" file="f13" line="449"/>
  </Function>
  <Function id="_230" name="stpcpy" returns="_247" context="_1" location="f13:451" file="f13" line="451" extern="1" artificial="1" mangled="_Z6stpcpy">
    <Argument type="_247"/>
    <Argument type="_249"/>
  </Function>
  <Function id="_231" name="__stpncpy" returns="_247" context="_1" location="f13:456" file="f13" line="456" extern="1" mangled="_Z9__stpncpy">
    <Argument name="__dest" type="_247r" location="f13:456" file="f13" line="456"/>
    <Argument name="__src" type="_249r" location="f13:457" file="f13" line="457"/>
    <Argument name="__n" type="_8" location="f13:457" file="f13" line="457"/>
  </Function>
  <Function id="_232" name="stpncpy" returns="_247" context="_1" location="f13:459" file="f13" line="459" extern="1" artificial="1" mangled="_Z7stpncpy">
    <Argument type="_247"/>
    <Argument type="_249"/>
    <Argument type="_250"/>
  </Function>
  <Enumeration id="_233" name="car_type" context="_1" location="f1:19" file="f1" line="19" size="32" align="32">
    <EnumValue name="Sedan" init="0"/>
    <EnumValue name="Station_Wagon" init="5"/>
    <EnumValue name="Bus" init="7"/>
    <EnumValue name="Pickup" init="12"/>
  </Enumeration>
  <Struct id="_234" name="sedan_properties_s" context="_1" location="f1:21" file="f1" line="21" members="_312" size="16" align="8"/>
  <Struct id="_235" name="station_wagon_properties_s" context="_1" location="f1:25" file="f1" line="25" members="_313" size="32" align="8"/>
  <Struct id="_236" name="bus_properties_s" context="_1" location="f1:29" file="f1" line="29" members="_314 _315 _316" size="56" align="8"/>
  <Struct id="_237" name="pickup_properties_s" context="_1" location="f1:35" file="f1" line="35" members="_317" size="32" align="8"/>
  <Union id="_238" name="type_specific_properties_u" context="_1" location="f1:39" file="f1" line="39" members="_318 _319 _320 _321" size="56" align="8"/>
  <Struct id="_239" name="car_properties_s" context="_1" location="f1:47" file="f1" line="47" members="_322 _323 _324" size="8" align="8"/>
  <Struct id="_240" name="car_s" context="_1" location="f1:53" file="f1" line="53" members="_325 _326 _327 _328 _329 _330" size="592" align="8"/>
  <Struct id="_241" name="garage_s" context="_1" location="f1:63" file="f1" line="63" members="_331 _332" size="11848" align="8"/>
  <Struct id="_242" name="house_s" context="_1" location="f1:69" file="f1" line="69" members="_333 _334" size="11856" align="8"/>
  <Function id="_243" name="main" returns="_256" context="_1" location="f1:74" file="f1" line="74"/>
  <FundamentalType id="_244" name="__int128" size="128" align="128"/>
  <FundamentalType id="_245" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_246" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_335 _336 _337 _338" size="256" align="64"/>
  <PointerType id="_247" type="_339" size="64" align="64"/>
  <CvQualifiedType id="_247r" type="_247" restrict="1"/>
  <ArrayType id="_248" min="0" max="0" type="_340"/>
  <PointerType id="_249" type="_339c" size="64" align="64"/>
  <CvQualifiedType id="_249r" type="_249" restrict="1"/>
  <FundamentalType id="_250" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_251" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_252" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_253" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_254" name="signed char" size="8" align="8"/>
  <FundamentalType id="_255" name="short int" size="16" align="16"/>
  <FundamentalType id="_256" name="int" size="32" align="32"/>
  <FundamentalType id="_257" name="long int" size="64" align="64"/>
  <Field id="_258" name="__val" type="_341" context="_45" access="public" location="f4:153" file="f4" line="153" offset="0"/>
  <PointerType id="_259" type="_296" size="64" align="64"/>
  <CvQualifiedType id="_259r" type="_259" restrict="1"/>
  <Field id="_260" name="__count" type="_256" context="_74" access="public" location="f5:15" file="f5" line="15" offset="0"/>
  <Union id="_261" name="" context="_74" location="f5:16" file="f5" line="16" members="_342 _343" size="32" align="8"/>
  <Field id="_262" name="__value" type="_261" context="_74" access="public" location="f5:20" file="f5" line="20" offset="32"/>
  <Field id="_263" name="__pos" type="_42" context="_76" access="public" location="f6:12" file="f6" line="12" offset="0"/>
  <Field id="_264" name="__state" type="_75" context="_76" access="public" location="f6:13" file="f6" line="13" offset="64"/>
  <Field id="_265" name="__pos" type="_43" context="_78" access="public" location="f7:12" file="f7" line="12" offset="0"/>
  <Field id="_266" name="__state" type="_75" context="_78" access="public" location="f7:13" file="f7" line="13" offset="64"/>
  <Field id="_267" name="_flags" type="_256" context="_80" access="public" location="f8:51" file="f8" line="51" offset="0"/>
  <Field id="_268" name="_IO_read_ptr" type="_247" context="_80" access="public" location="f8:54" file="f8" line="54" offset="32"/>
  <Field id="_269" name="_IO_read_end" type="_247" context="_80" access="public" location="f8:55" file="f8" line="55" offset="96"/>
  <Field id="_270" name="_IO_read_base" type="_247" context="_80" access="public" location="f8:56" file="f8" line="56" offset="160"/>
  <Field id="_271" name="_IO_write_base" type="_247" context="_80" access="public" location="f8:57" file="f8" line="57" offset="224"/>
  <Field id="_272" name="_IO_write_ptr" type="_247" context="_80" access="public" location="f8:58" file="f8" line="58" offset="288"/>
  <Field id="_273" name="_IO_write_end" type="_247" context="_80" access="public" location="f8:59" file="f8" line="59" offset="352"/>
  <Field id="_274" name="_IO_buf_base" type="_247" context="_80" access="public" location="f8:60" file="f8" line="60" offset="416"/>
  <Field id="_275" name="_IO_buf_end" type="_247" context="_80" access="public" location="f8:61" file="f8" line="61" offset="480"/>
  <Field id="_276" name="_IO_save_base" type="_247" context="_80" access="public" location="f8:64" file="f8" line="64" offset="544"/>
  <Field id="_277" name="_IO_backup_base" type="_247" context="_80" access="public" location="f8:65" file="f8" line="65" offset="608"/>
  <Field id="_278" name="_IO_save_end" type="_247" context="_80" access="public" location="f8:66" file="f8" line="66" offset="672"/>
  <Field id="_279" name="_markers" type="_344" context="_80" access="public" location="f8:68" file="f8" line="68" offset="736"/>
  <Field id="_280" name="_chain" type="_345" context="_80" access="public" location="f8:70" file="f8" line="70" offset="800"/>
  <Field id="_281" name="_fileno" type="_256" context="_80" access="public" location="f8:72" file="f8" line="72" offset="864"/>
  <Field id="_282" name="_flags2" type="_256" context="_80" access="public" location="f8:73" file="f8" line="73" offset="896"/>
  <Field id="_283" name="_old_offset" type="_42" context="_80" access="public" location="f8:74" file="f8" line="74" offset="928"/>
  <Field id="_284" name="_cur_column" type="_252" context="_80" access="public" location="f8:77" file="f8" line="77" offset="992"/>
  <Field id="_285" name="_vtable_offset" type="_254" context="_80" access="public" location="f8:78" file="f8" line="78" offset="1008"/>
  <Field id="_286" name="_shortbuf" type="_346" context="_80" access="public" location="f8:79" file="f8" line="79" offset="1016"/>
  <Field id="_287" name="_lock" type="_347" context="_80" access="public" location="f8:81" file="f8" line="81" offset="1024"/>
  <Field id="_288" name="_offset" type="_43" context="_80" access="public" location="f8:89" file="f8" line="89" offset="1088"/>
  <Field id="_289" name="_codecvt" type="_348" context="_80" access="public" location="f8:91" file="f8" line="91" offset="1152"/>
  <Field id="_290" name="_wide_data" type="_349" context="_80" access="public" location="f8:92" file="f8" line="92" offset="1216"/>
  <Field id="_291" name="_freeres_list" type="_345" context="_80" access="public" location="f8:93" file="f8" line="93" offset="1280"/>
  <Field id="_292" name="_freeres_buf" type="_259" context="_80" access="public" location="f8:94" file="f8" line="94" offset="1344"/>
  <Field id="_293" name="__pad5" type="_8" context="_80" access="public" location="f8:95" file="f8" line="95" offset="1408"/>
  <Field id="_294" name="_mode" type="_256" context="_80" access="public" location="f8:96" file="f8" line="96" offset="1472"/>
  <Field id="_295" name="_unused2" type="_350" context="_80" access="public" location="f8:98" file="f8" line="98" offset="1504"/>
  <FundamentalType id="_296" name="void" size="0" align="8"/>
  <PointerType id="_297" type="_82" size="64" align="64"/>
  <CvQualifiedType id="_297r" type="_297" restrict="1"/>
  <PointerType id="_298" type="_247" size="64" align="64"/>
  <CvQualifiedType id="_298r" type="_298" restrict="1"/>
  <PointerType id="_299" type="_8" size="64" align="64"/>
  <CvQualifiedType id="_299r" type="_299" restrict="1"/>
  <PointerType id="_300" type="_340" size="64" align="64"/>
  <PointerType id="_301" type="_296c" size="64" align="64"/>
  <CvQualifiedType id="_296c" type="_296" const="1"/>
  <CvQualifiedType id="_301r" type="_301" restrict="1"/>
  <PointerType id="_302" type="_89" size="64" align="64"/>
  <CvQualifiedType id="_302r" type="_302" restrict="1"/>
  <PointerType id="_303" type="_89c" size="64" align="64"/>
  <CvQualifiedType id="_89c" type="_89" const="1"/>
  <ArrayType id="_304" min="0" max="" type="_249c"/>
  <CvQualifiedType id="_249c" type="_249" const="1"/>
  <Field id="_305" name="__locales" type="_351" context="_193" access="public" location="f14:31" file="f14" line="31" offset="0"/>
  <Field id="_306" name="__ctype_b" type="_352" context="_193" access="public" location="f14:34" file="f14" line="34" offset="832"/>
  <Field id="_307" name="__ctype_tolower" type="_353" context="_193" access="public" location="f14:35" file="f14" line="35" offset="896"/>
  <Field id="_308" name="__ctype_toupper" type="_353" context="_193" access="public" location="f14:36" file="f14" line="36" offset="960"/>
  <Field id="_309" name="__names" type="_354" context="_193" access="public" location="f14:39" file="f14" line="39" offset="1024"/>
  <PointerType id="_310" type="_193" size="64" align="64"/>
  <FundamentalType id="_311" name="long long int" size="64" align="64"/>
  <Field id="_312" name="sedan_code" type="_252" context="_234" access="public" location="f1:22" file="f1" line="22" offset="0"/>
  <Field id="_313" name="trunk_volume" type="_256" context="_235" access="public" location="f1:26" file="f1" line="26" offset="0"/>
  <Field id="_314" name="number_of_passangers" type="_256" context="_236" access="public" location="f1:30" file="f1" line="30" offset="0"/>
  <Field id="_315" name="number_of_entries" type="_252" context="_236" access="public" location="f1:31" file="f1" line="31" offset="32"/>
  <Field id="_316" name="is_accordion_bus" type="_251" context="_236" access="public" location="f1:32" file="f1" line="32" offset="48"/>
  <Field id="_317" name="truck_bed_volume" type="_256" context="_237" access="public" location="f1:36" file="f1" line="36" offset="0"/>
  <Field id="_318" name="sedan" type="_234" context="_238" access="public" location="f1:40" file="f1" line="40" offset="0"/>
  <Field id="_319" name="station_wagon" type="_235" context="_238" access="public" location="f1:41" file="f1" line="41" offset="0"/>
  <Field id="_320" name="bus" type="_236" context="_238" access="public" location="f1:42" file="f1" line="42" offset="0"/>
  <Field id="_321" name="pickup" type="_237" context="_238" access="public" location="f1:43" file="f1" line="43" offset="0"/>
  <Field id="_322" name="env_class" type="_253" bits="3" context="_239" access="public" location="f1:48" file="f1" line="48" offset="0"/>
  <Field id="_323" name="registered" type="_253" bits="1" context="_239" access="public" location="f1:49" file="f1" line="49" offset="3"/>
  <Field id="_324" name="over_3500_kg" type="_253" bits="1" context="_239" access="public" location="f1:50" file="f1" line="50" offset="4"/>
  <Field id="_325" name="year" type="_252" context="_240" access="public" location="f1:55" file="f1" line="55" offset="0"/>
  <Field id="_326" name="model" type="_355" context="_240" access="public" location="f1:56" file="f1" line="56" offset="16"/>
  <Field id="_327" name="registration_number" type="_356" context="_240" access="public" location="f1:57" file="f1" line="57" offset="416"/>
  <Field id="_328" name="properties" type="_239" context="_240" access="public" location="f1:58" file="f1" line="58" offset="496"/>
  <Field id="_329" name="type" type="_233" context="_240" access="public" location="f1:59" file="f1" line="59" offset="504"/>
  <Field id="_330" name="type_properties" type="_238" context="_240" access="public" location="f1:60" file="f1" line="60" offset="536"/>
  <Field id="_331" name="cars" type="_357" context="_241" access="public" location="f1:65" file="f1" line="65" offset="0"/>
  <Field id="_332" name="nbr_registered_parkings" type="_251" context="_241" access="public" location="f1:66" file="f1" line="66" offset="11840"/>
  <Field id="_333" name="nbr_of_levels" type="_251" context="_242" access="public" location="f1:70" file="f1" line="70" offset="0"/>
  <Field id="_334" name="garage" type="_241" context="_242" access="public" location="f1:71" file="f1" line="71" offset="8"/>
  <Field id="_335" name="isa" type="_353" context="_246" access="public" offset="0"/>
  <Field id="_336" name="flags" type="_256" context="_246" access="public" offset="64"/>
  <Field id="_337" name="str" type="_249" context="_246" access="public" offset="128"/>
  <Field id="_338" name="length" type="_257" context="_246" access="public" offset="192"/>
  <CvQualifiedType id="_339c" type="_339" const="1"/>
  <Struct id="_340" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_358 _359 _360 _361" size="192" align="64"/>
  <ArrayType id="_341" min="0" max="1" type="_256"/>
  <Field id="_342" name="__wch" type="_253" context="_261" access="public" location="f5:18" file="f5" line="18" offset="0"/>
  <Field id="_343" name="__wchb" type="_362" context="_261" access="public" location="f5:19" file="f5" line="19" offset="0"/>
  <PointerType id="_344" type="_83" size="64" align="64"/>
  <PointerType id="_345" type="_80" size="64" align="64"/>
  <ArrayType id="_346" min="0" max="0" type="_339"/>
  <FundamentalType id="_339" name="char" size="8" align="8"/>
  <PointerType id="_347" type="_86" size="64" align="64"/>
  <PointerType id="_348" type="_84" size="64" align="64"/>
  <PointerType id="_349" type="_85" size="64" align="64"/>
  <ArrayType id="_350" min="0" max="19" type="_339"/>
  <ArrayType id="_351" min="0" max="12" type="_363"/>
  <PointerType id="_352" type="_252c" size="64" align="64"/>
  <CvQualifiedType id="_252c" type="_252" const="1"/>
  <PointerType id="_353" type="_256c" size="64" align="64"/>
  <CvQualifiedType id="_256c" type="_256" const="1"/>
  <ArrayType id="_354" min="0" max="12" type="_249"/>
  <ArrayType id="_355" min="0" max="49" type="_339"/>
  <ArrayType id="_356" min="0" max="9" type="_339"/>
  <ArrayType id="_357" min="0" max="19" type="_240"/>
  <Field id="_358" name="gp_offset" type="_253" context="_340" access="public" offset="0"/>
  <Field id="_359" name="fp_offset" type="_253" context="_340" access="public" offset="32"/>
  <Field id="_360" name="overflow_arg_area" type="_259" context="_340" access="public" offset="64"/>
  <Field id="_361" name="reg_save_area" type="_259" context="_340" access="public" offset="128"/>
  <ArrayType id="_362" min="0" max="3" type="_339"/>
  <PointerType id="_363" type="_364" size="64" align="64"/>
  <Struct id="_364" name="__locale_data" context="_1" location="f14:31" file="f14" line="31" incomplete="1"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="embedded_struct.c"/>
  <File id="f2" name="/home/joelmidstjarna/castxml/share/castxml/clang/include/stddef.h"/>
  <File id="f3" name="/home/joelmidstjarna/castxml/share/castxml/clang/include/stdarg.h"/>
  <File id="f4" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f5" name="/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h"/>
  <File id="f6" name="/usr/include/x86_64-linux-gnu/bits/types/__fpos_t.h"/>
  <File id="f7" name="/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h"/>
  <File id="f8" name="/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h"/>
  <File id="f9" name="/usr/include/x86_64-linux-gnu/bits/types/__FILE.h"/>
  <File id="f10" name="/usr/include/x86_64-linux-gnu/bits/types/FILE.h"/>
  <File id="f11" name="/usr/include/stdio.h"/>
  <File id="f12" name="/usr/include/x86_64-linux-gnu/bits/sys_errlist.h"/>
  <File id="f13" name="/usr/include/string.h"/>
  <File id="f14" name="/usr/include/x86_64-linux-gnu/bits/types/__locale_t.h"/>
  <File id="f15" name="/usr/include/x86_64-linux-gnu/bits/types/locale_t.h"/>
  <File id="f16" name="/usr/include/strings.h"/>
</GCC_XML>
