<?xml version="1.0"?>
<CastXML format="1.1.5">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _159 _160 _161 _162 _163 _164 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _199 _200 _201 _202 _203 _204 _205 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _216 _217 _218 _219 _220 _221 _222 _223 _224 _225 _226 _227 _228 _229 _230 _231 _232 _233 _234 _235 _236 _237 _238 _239 _240 _241 _242 _243 _244 _245 _246 _247 _248 _249 _250 _251 _252 _253 _254"/>
  <Typedef id="_2" name="__int128_t" type="_255" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_256" context="_1" location="f0:0" file="f0" line="0"/>

  <Function id="_232" name="bcmp" returns="_267" context="_1" location="f10:457" file="f10" line="457" extern="1" mangled="_Z4bcmp">
    <Argument name="__s1" type="_329" location="f10:457" file="f10" line="457"/>
    <Argument name="__s2" type="_329" location="f10:457" file="f10" line="457"/>
    <Argument name="__n" type="_8" location="f10:457" file="f10" line="457"/>
  </Function>
  <Function id="_233" name="index" returns="_258" context="_1" location="f10:484" file="f10" line="484" extern="1" artificial="1" mangled="_Z5index">
    <Argument type="_260"/>
    <Argument type="_267"/>
  </Function>
  <Function id="_234" name="rindex" returns="_258" context="_1" location="f10:512" file="f10" line="512" extern="1" artificial="1" mangled="_Z6rindex">
    <Argument type="_260"/>
    <Argument type="_267"/>
  </Function>
  <Function id="_235" name="ffs" returns="_267" context="_1" location="f10:518" file="f10" line="518" extern="1" mangled="_Z3ffs">
    <Argument name="__i" type="_267" location="f10:518" file="f10" line="518"/>
  </Function>
  <Function id="_236" name="strcasecmp" returns="_267" context="_1" location="f10:529" file="f10" line="529" extern="1" artificial="1" mangled="_Z10strcasecmp">
    <Argument type="_260"/>
    <Argument type="_260"/>
  </Function>
  <Function id="_237" name="strncasecmp" returns="_267" context="_1" location="f10:533" file="f10" line="533" extern="1" artificial="1" mangled="_Z11strncasecmp">
    <Argument type="_260"/>
    <Argument type="_260"/>
    <Argument type="_261"/>
  </Function>
  <Function id="_238" name="strsep" returns="_258" context="_1" location="f10:552" file="f10" line="552" extern="1" mangled="_Z6strsep">
    <Argument name="__stringp" type="_327r" location="f10:552" file="f10" line="552"/>
    <Argument name="__delim" type="_260r" location="f10:553" file="f10" line="553"/>
  </Function>
  <Function id="_239" name="strsignal" returns="_258" context="_1" location="f10:559" file="f10" line="559" extern="1" mangled="_Z9strsignal">
    <Argument name="__sig" type="_267" location="f10:559" file="f10" line="559"/>
  </Function>
  <Function id="_240" name="__stpcpy" returns="_258" context="_1" location="f10:562" file="f10" line="562" extern="1" mangled="_Z8__stpcpy">
    <Argument name="__dest" type="_258r" location="f10:562" file="f10" line="562"/>
    <Argument name="__src" type="_260r" location="f10:562" file="f10" line="562"/>
  </Function>
  <Function id="_241" name="stpcpy" returns="_258" context="_1" location="f10:564" file="f10" line="564" extern="1" artificial="1" mangled="_Z6stpcpy">
    <Argument type="_258"/>
    <Argument type="_260"/>
  </Function>
  <Function id="_242" name="__stpncpy" returns="_258" context="_1" location="f10:569" file="f10" line="569" extern="1" mangled="_Z9__stpncpy">
    <Argument name="__dest" type="_258r" location="f10:569" file="f10" line="569"/>
    <Argument name="__src" type="_260r" location="f10:570" file="f10" line="570"/>
    <Argument name="__n" type="_8" location="f10:570" file="f10" line="570"/>
  </Function>
  <Function id="_243" name="stpncpy" returns="_258" context="_1" location="f10:572" file="f10" line="572" extern="1" artificial="1" mangled="_Z7stpncpy">
    <Argument type="_258"/>
    <Argument type="_260"/>
    <Argument type="_261"/>
  </Function>
  <Enumeration id="_244" name="car_type" context="_1" location="f1:19" file="f1" line="19" size="32" align="32">
    <EnumValue name="Sedan" init="0"/>
    <EnumValue name="Station_Wagon" init="5"/>
    <EnumValue name="Bus" init="7"/>
    <EnumValue name="Pickup" init="12"/>
  </Enumeration>
  <Struct id="_245" name="sedan_properties_s" context="_1" location="f1:21" file="f1" line="21" members="_339" size="16" align="8"/>
  <Struct id="_246" name="station_wagon_properties_s" context="_1" location="f1:25" file="f1" line="25" members="_340" size="32" align="8"/>
  <Struct id="_247" name="bus_properties_s" context="_1" location="f1:29" file="f1" line="29" members="_341 _342 _343" size="56" align="8"/>
  <Struct id="_248" name="pickup_properties_s" context="_1" location="f1:35" file="f1" line="35" members="_344" size="32" align="8"/>
  <Union id="_249" name="type_specific_properties_u" context="_1" location="f1:39" file="f1" line="39" members="_345 _346 _347 _348" size="56" align="8"/>
  <Struct id="_250" name="car_properties_s" context="_1" location="f1:47" file="f1" line="47" members="_349 _350 _351" size="8" align="8"/>
  <Struct id="_251" name="car_s" context="_1" location="f1:53" file="f1" line="53" members="_352 _353 _354 _355 _356 _357" size="592" align="8"/>
  <Struct id="_252" name="garage_s" context="_1" location="f1:63" file="f1" line="63" members="_358 _359" size="11848" align="8"/>
  <Struct id="_253" name="house_s" context="_1" location="f1:69" file="f1" line="69" members="_360 _361" size="11856" align="8"/>
  <Function id="_254" name="main" returns="_267" context="_1" location="f1:74" file="f1" line="74"/>
  <FundamentalType id="_255" name="__int128" size="128" align="128"/>
  <FundamentalType id="_256" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_257" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_362 _363 _364 _365" size="256" align="64"/>
  <PointerType id="_258" type="_366" size="64" align="64"/>
  <CvQualifiedType id="_258r" type="_258" restrict="1"/>
  <ArrayType id="_259" min="0" max="0" type="_367"/>
  <PointerType id="_260" type="_366c" size="64" align="64"/>
  <CvQualifiedType id="_260r" type="_260" restrict="1"/>
  <FundamentalType id="_261" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_262" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_263" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_264" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_265" name="signed char" size="8" align="8"/>
  <FundamentalType id="_266" name="short int" size="16" align="16"/>
  <FundamentalType id="_267" name="int" size="32" align="32"/>
  <FundamentalType id="_268" name="long int" size="64" align="64"/>
  <Field id="_269" name="__val" type="_368" context="_33" access="public" location="f3:134" file="f3" line="134" offset="0"/>
  <ElaboratedType id="_270" type="_33"/>
  <PointerType id="_271" type="_313" size="64" align="64"/>
  <CvQualifiedType id="_271r" type="_271" restrict="1"/>
  <PointerType id="_272" type="_21" size="64" align="64"/>
  <Field id="_273" name="_flags" type="_267" context="_62" access="public" location="f4:242" file="f4" line="242" offset="0"/>
  <Field id="_274" name="_IO_read_ptr" type="_258" context="_62" access="public" location="f4:247" file="f4" line="247" offset="32"/>
  <Field id="_275" name="_IO_read_end" type="_258" context="_62" access="public" location="f4:248" file="f4" line="248" offset="96"/>
  <Field id="_276" name="_IO_read_base" type="_258" context="_62" access="public" location="f4:249" file="f4" line="249" offset="160"/>
  <Field id="_277" name="_IO_write_base" type="_258" context="_62" access="public" location="f4:250" file="f4" line="250" offset="224"/>
  <Field id="_278" name="_IO_write_ptr" type="_258" context="_62" access="public" location="f4:251" file="f4" line="251" offset="288"/>
  <Field id="_279" name="_IO_write_end" type="_258" context="_62" access="public" location="f4:252" file="f4" line="252" offset="352"/>
  <Field id="_280" name="_IO_buf_base" type="_258" context="_62" access="public" location="f4:253" file="f4" line="253" offset="416"/>
  <Field id="_281" name="_IO_buf_end" type="_258" context="_62" access="public" location="f4:254" file="f4" line="254" offset="480"/>
  <Field id="_282" name="_IO_save_base" type="_258" context="_62" access="public" location="f4:256" file="f4" line="256" offset="544"/>
  <Field id="_283" name="_IO_backup_base" type="_258" context="_62" access="public" location="f4:257" file="f4" line="257" offset="608"/>
  <Field id="_284" name="_IO_save_end" type="_258" context="_62" access="public" location="f4:258" file="f4" line="258" offset="672"/>
  <Field id="_285" name="_markers" type="_369" context="_62" access="public" location="f4:260" file="f4" line="260" offset="736"/>
  <Field id="_286" name="_chain" type="_325" context="_62" access="public" location="f4:262" file="f4" line="262" offset="800"/>
  <Field id="_287" name="_fileno" type="_267" context="_62" access="public" location="f4:264" file="f4" line="264" offset="864"/>
  <Field id="_288" name="_flags2" type="_267" context="_62" access="public" location="f4:268" file="f4" line="268" offset="896"/>
  <Field id="_289" name="_old_offset" type="_30" context="_62" access="public" location="f4:270" file="f4" line="270" offset="928"/>
  <Field id="_290" name="_cur_column" type="_263" context="_62" access="public" location="f4:274" file="f4" line="274" offset="992"/>
  <Field id="_291" name="_vtable_offset" type="_265" context="_62" access="public" location="f4:275" file="f4" line="275" offset="1008"/>
  <Field id="_292" name="_shortbuf" type="_370" context="_62" access="public" location="f4:276" file="f4" line="276" offset="1016"/>
  <Field id="_293" name="_lock" type="_371" context="_62" access="public" location="f4:280" file="f4" line="280" offset="1024"/>
  <Field id="_294" name="_offset" type="_31" context="_62" access="public" location="f4:289" file="f4" line="289" offset="1088"/>
  <Field id="_295" name="__pad1" type="_271" context="_62" access="public" location="f4:297" file="f4" line="297" offset="1152"/>
  <Field id="_296" name="__pad2" type="_271" context="_62" access="public" location="f4:298" file="f4" line="298" offset="1216"/>
  <Field id="_297" name="__pad3" type="_271" context="_62" access="public" location="f4:299" file="f4" line="299" offset="1280"/>
  <Field id="_298" name="__pad4" type="_271" context="_62" access="public" location="f4:300" file="f4" line="300" offset="1344"/>
  <Field id="_299" name="__pad5" type="_8" context="_62" access="public" location="f4:302" file="f4" line="302" offset="1408"/>
  <Field id="_300" name="_mode" type="_267" context="_62" access="public" location="f4:303" file="f4" line="303" offset="1472"/>
  <Field id="_301" name="_unused2" type="_372" context="_62" access="public" location="f4:305" file="f4" line="305" offset="1504"/>
  <ElaboratedType id="_302" type="_62"/>
  <Field id="_303" name="__count" type="_267" context="_65" access="public" location="f6:84" file="f6" line="84" offset="0"/>
  <Union id="_304" name="" context="_65" location="f6:85" file="f6" line="85" members="_373 _374" size="32" align="8"/>
  <Field id="_305" name="__value" type="_375" context="_65" access="public" location="f6:93" file="f6" line="93" offset="32"/>
  <ElaboratedType id="_306" type="_65"/>
  <Field id="_307" name="__pos" type="_30" context="_67" access="public" location="f7:23" file="f7" line="23" offset="0"/>
  <Field id="_308" name="__state" type="_66" context="_67" access="public" location="f7:24" file="f7" line="24" offset="64"/>
  <ElaboratedType id="_309" type="_67"/>
  <Field id="_310" name="__pos" type="_31" context="_69" access="public" location="f7:28" file="f7" line="28" offset="0"/>
  <Field id="_311" name="__state" type="_66" context="_69" access="public" location="f7:29" file="f7" line="29" offset="64"/>
  <ElaboratedType id="_312" type="_69"/>
  <FundamentalType id="_313" name="void" size="0" align="8"/>
  <Field id="_314" name="_next" type="_369" context="_75" access="public" location="f4:157" file="f4" line="157" offset="0"/>
  <Field id="_315" name="_sbuf" type="_325" context="_75" access="public" location="f4:158" file="f4" line="158" offset="64"/>
  <Field id="_316" name="_pos" type="_267" context="_75" access="public" location="f4:162" file="f4" line="162" offset="128"/>
  <ElaboratedType id="_317" type="_78"/>
  <FunctionType id="_318" returns="_54">
    <Argument type="_271"/>
    <Argument type="_258"/>
    <Argument type="_8"/>
  </FunctionType>
  <FunctionType id="_319" returns="_54">
    <Argument type="_271"/>
    <Argument type="_260"/>
    <Argument type="_8"/>
  </FunctionType>
  <FunctionType id="_320" returns="_267">
    <Argument type="_271"/>
    <Argument type="_376"/>
    <Argument type="_267"/>
  </FunctionType>
  <FunctionType id="_321" returns="_267">
    <Argument type="_271"/>
  </FunctionType>
  <PointerType id="_322" type="_77" size="64" align="64"/>
  <CvQualifiedType id="_322r" type="_322" restrict="1"/>
  <PointerType id="_323" type="_367" size="64" align="64"/>
  <PointerType id="_324" type="_267" size="64" align="64"/>
  <CvQualifiedType id="_324r" type="_324" restrict="1"/>
  <PointerType id="_325" type="_302" size="64" align="64"/>
  <PointerType id="_326" type="_63" size="64" align="64"/>
  <CvQualifiedType id="_326r" type="_326" restrict="1"/>
  <PointerType id="_327" type="_258" size="64" align="64"/>
  <CvQualifiedType id="_327r" type="_327" restrict="1"/>
  <PointerType id="_328" type="_8" size="64" align="64"/>
  <CvQualifiedType id="_328r" type="_328" restrict="1"/>
  <PointerType id="_329" type="_313c" size="64" align="64"/>
  <CvQualifiedType id="_313c" type="_313" const="1"/>
  <CvQualifiedType id="_329r" type="_329" restrict="1"/>
  <PointerType id="_330" type="_106" size="64" align="64"/>
  <CvQualifiedType id="_330r" type="_330" restrict="1"/>
  <PointerType id="_331" type="_106c" size="64" align="64"/>
  <CvQualifiedType id="_106c" type="_106" const="1"/>
  <ArrayType id="_332" min="0" max="" type="_260c"/>
  <CvQualifiedType id="_260c" type="_260" const="1"/>
  <Field id="_333" name="__locales" type="_377" context="_208" access="public" location="f11:30" file="f11" line="30" offset="0"/>
  <Field id="_334" name="__ctype_b" type="_378" context="_208" access="public" location="f11:33" file="f11" line="33" offset="832"/>
  <Field id="_335" name="__ctype_tolower" type="_379" context="_208" access="public" location="f11:34" file="f11" line="34" offset="896"/>
  <Field id="_336" name="__ctype_toupper" type="_379" context="_208" access="public" location="f11:35" file="f11" line="35" offset="960"/>
  <Field id="_337" name="__names" type="_380" context="_208" access="public" location="f11:38" file="f11" line="38" offset="1024"/>
  <PointerType id="_338" type="_381" size="64" align="64"/>
  <Field id="_339" name="sedan_code" type="_263" context="_245" access="public" location="f1:22" file="f1" line="22" offset="0"/>
  <Field id="_340" name="trunk_volume" type="_267" context="_246" access="public" location="f1:26" file="f1" line="26" offset="0"/>
  <Field id="_341" name="number_of_passangers" type="_267" context="_247" access="public" location="f1:30" file="f1" line="30" offset="0"/>
  <Field id="_342" name="number_of_entries" type="_263" context="_247" access="public" location="f1:31" file="f1" line="31" offset="32"/>
  <Field id="_343" name="is_accordion_bus" type="_262" context="_247" access="public" location="f1:32" file="f1" line="32" offset="48"/>
  <Field id="_344" name="truck_bed_volume" type="_267" context="_248" access="public" location="f1:36" file="f1" line="36" offset="0"/>
  <Field id="_345" name="sedan" type="_382" context="_249" access="public" location="f1:40" file="f1" line="40" offset="0"/>
  <Field id="_346" name="station_wagon" type="_383" context="_249" access="public" location="f1:41" file="f1" line="41" offset="0"/>
  <Field id="_347" name="bus" type="_384" context="_249" access="public" location="f1:42" file="f1" line="42" offset="0"/>
  <Field id="_348" name="pickup" type="_385" context="_249" access="public" location="f1:43" file="f1" line="43" offset="0"/>
  <Field id="_349" name="env_class" type="_264" bits="3" context="_250" access="public" location="f1:48" file="f1" line="48" offset="0"/>
  <Field id="_350" name="registered" type="_264" bits="1" context="_250" access="public" location="f1:49" file="f1" line="49" offset="3"/>
  <Field id="_351" name="over_3500_kg" type="_264" bits="1" context="_250" access="public" location="f1:50" file="f1" line="50" offset="4"/>
  <Field id="_352" name="year" type="_263" context="_251" access="public" location="f1:55" file="f1" line="55" offset="0"/>
  <Field id="_353" name="model" type="_386" context="_251" access="public" location="f1:56" file="f1" line="56" offset="16"/>
  <Field id="_354" name="registration_number" type="_387" context="_251" access="public" location="f1:57" file="f1" line="57" offset="416"/>
  <Field id="_355" name="properties" type="_388" context="_251" access="public" location="f1:58" file="f1" line="58" offset="496"/>
  <Field id="_356" name="type" type="_389" context="_251" access="public" location="f1:59" file="f1" line="59" offset="504"/>
  <Field id="_357" name="type_properties" type="_390" context="_251" access="public" location="f1:60" file="f1" line="60" offset="536"/>
  <Field id="_358" name="cars" type="_391" context="_252" access="public" location="f1:65" file="f1" line="65" offset="0"/>
  <Field id="_359" name="nbr_registered_parkings" type="_262" context="_252" access="public" location="f1:66" file="f1" line="66" offset="11840"/>
  <Field id="_360" name="nbr_of_levels" type="_262" context="_253" access="public" location="f1:70" file="f1" line="70" offset="0"/>
  <Field id="_361" name="garage" type="_392" context="_253" access="public" location="f1:71" file="f1" line="71" offset="8"/>
  <Field id="_362" name="isa" type="_379" context="_257" access="public" offset="0"/>
  <Field id="_363" name="flags" type="_267" context="_257" access="public" offset="64"/>
  <Field id="_364" name="str" type="_260" context="_257" access="public" offset="128"/>
  <Field id="_365" name="length" type="_268" context="_257" access="public" offset="192"/>
  <CvQualifiedType id="_366c" type="_366" const="1"/>
  <Struct id="_367" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_393 _394 _395 _396" size="192" align="64"/>
  <ArrayType id="_368" min="0" max="1" type="_267"/>
  <PointerType id="_369" type="_397" size="64" align="64"/>
  <ArrayType id="_370" min="0" max="0" type="_366"/>
  <FundamentalType id="_366" name="char" size="8" align="8"/>
  <PointerType id="_371" type="_74" size="64" align="64"/>
  <ArrayType id="_372" min="0" max="19" type="_366"/>
  <Field id="_373" name="__wch" type="_264" context="_304" access="public" location="f6:88" file="f6" line="88" offset="0"/>
  <Field id="_374" name="__wchb" type="_398" context="_304" access="public" location="f6:92" file="f6" line="92" offset="0"/>
  <ElaboratedType id="_375" type="_304"/>
  <PointerType id="_376" type="_31" size="64" align="64"/>
  <ArrayType id="_377" min="0" max="12" type="_399"/>
  <PointerType id="_378" type="_263c" size="64" align="64"/>
  <CvQualifiedType id="_263c" type="_263" const="1"/>
  <PointerType id="_379" type="_267c" size="64" align="64"/>
  <CvQualifiedType id="_267c" type="_267" const="1"/>
  <ArrayType id="_380" min="0" max="12" type="_260"/>
  <ElaboratedType id="_382" type="_245"/>
  <ElaboratedType id="_383" type="_246"/>
  <ElaboratedType id="_384" type="_247"/>
  <ElaboratedType id="_385" type="_248"/>
  <ArrayType id="_386" min="0" max="49" type="_366"/>
  <ArrayType id="_387" min="0" max="9" type="_366"/>
  <ElaboratedType id="_388" type="_250"/>
  <ElaboratedType id="_389" type="_244"/>
  <ElaboratedType id="_390" type="_249"/>
  <ArrayType id="_391" min="0" max="19" type="_400"/>
  <ElaboratedType id="_392" type="_252"/>
  <Field id="_393" name="gp_offset" type="_264" context="_367" access="public" offset="0"/>
  <Field id="_394" name="fp_offset" type="_264" context="_367" access="public" offset="32"/>
  <Field id="_395" name="overflow_arg_area" type="_271" context="_367" access="public" offset="64"/>
  <Field id="_396" name="reg_save_area" type="_271" context="_367" access="public" offset="128"/>
  <ArrayType id="_398" min="0" max="3" type="_366"/>
  <PointerType id="_399" type="_401" size="64" align="64"/>
  <ElaboratedType id="_400" type="_251"/>
  <ElaboratedType id="_381" type="_208"/>
  <ElaboratedType id="_397" type="_75"/>
  <ElaboratedType id="_401" type="_402"/>
  <Struct id="_402" name="__locale_data" context="_1" location="f11:30" file="f11" line="30" incomplete="1"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="embedded_struct.c"/>
  <File id="f2" name="/home/joelmidstjarna/castxml/share/castxml/clang/include/stddef.h"/>
  <File id="f3" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f4" name="/usr/include/libio.h"/>
  <File id="f5" name="/usr/include/stdio.h"/>
  <File id="f6" name="/usr/include/wchar.h"/>
  <File id="f7" name="/usr/include/_G_config.h"/>
  <File id="f8" name="/home/joelmidstjarna/castxml/share/castxml/clang/include/stdarg.h"/>
  <File id="f9" name="/usr/include/x86_64-linux-gnu/bits/sys_errlist.h"/>
  <File id="f10" name="/usr/include/string.h"/>
  <File id="f11" name="/usr/include/xlocale.h"/>
</CastXML>
