<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.145">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _159 _160 _161 _162 _163 _164 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _199 _200 _201 _202 _203 _204 _205 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _216 _217 _218 _219 _220 _221 _222 _223 _224 _225 _226 _227 _228 _229 _230 _231 _232 _233 _234 _235 _236 _237 _238 _239 _240 _241 _242 _243 _244 _245 _246 _247 _248 _249 _250 _251"/>
  <Typedef id="_2" name="__int128_t" type="_252" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_253" context="_1" location="f0:0" file="f0" line="0"/>

    <Argument name="__s2" type="_257" location="f16:128" file="f16" line="128"/>
    <Argument name="__loc" type="_196" location="f16:128" file="f16" line="128"/>
  </Function>
  <Function id="_226" name="strncasecmp_l" returns="_264" context="_1" location="f16:133" file="f16" line="133" extern="1" mangled="_Z13strncasecmp_l">
    <Argument name="__s1" type="_257" location="f16:133" file="f16" line="133"/>
    <Argument name="__s2" type="_257" location="f16:133" file="f16" line="133"/>
    <Argument name="__n" type="_9" location="f16:134" file="f16" line="134"/>
    <Argument name="__loc" type="_196" location="f16:134" file="f16" line="134"/>
  </Function>
  <Function id="_227" name="explicit_bzero" returns="_304" context="_1" location="f13:435" file="f13" line="435" extern="1" mangled="_Z14explicit_bzero">
    <Argument name="__s" type="_267" location="f13:435" file="f13" line="435"/>
    <Argument name="__n" type="_9" location="f13:435" file="f13" line="435"/>
  </Function>
  <Function id="_228" name="strsep" returns="_255" context="_1" location="f13:439" file="f13" line="439" extern="1" mangled="_Z6strsep">
    <Argument name="__stringp" type="_306r" location="f13:439" file="f13" line="439"/>
    <Argument name="__delim" type="_257r" location="f13:440" file="f13" line="440"/>
  </Function>
  <Function id="_229" name="strsignal" returns="_255" context="_1" location="f13:446" file="f13" line="446" extern="1" mangled="_Z9strsignal">
    <Argument name="__sig" type="_264" location="f13:446" file="f13" line="446"/>
  </Function>
  <Function id="_230" name="__stpcpy" returns="_255" context="_1" location="f13:449" file="f13" line="449" extern="1" mangled="_Z8__stpcpy">
    <Argument name="__dest" type="_255r" location="f13:449" file="f13" line="449"/>
    <Argument name="__src" type="_257r" location="f13:449" file="f13" line="449"/>
  </Function>
  <Function id="_231" name="stpcpy" returns="_255" context="_1" location="f13:451" file="f13" line="451" extern="1" artificial="1" mangled="_Z6stpcpy">
    <Argument type="_255"/>
    <Argument type="_257"/>
  </Function>
  <Function id="_232" name="__stpncpy" returns="_255" context="_1" location="f13:456" file="f13" line="456" extern="1" mangled="_Z9__stpncpy">
    <Argument name="__dest" type="_255r" location="f13:456" file="f13" line="456"/>
    <Argument name="__src" type="_257r" location="f13:457" file="f13" line="457"/>
    <Argument name="__n" type="_9" location="f13:457" file="f13" line="457"/>
  </Function>
  <Function id="_233" name="stpncpy" returns="_255" context="_1" location="f13:459" file="f13" line="459" extern="1" artificial="1" mangled="_Z7stpncpy">
    <Argument type="_255"/>
    <Argument type="_257"/>
    <Argument type="_258"/>
  </Function>
  <Typedef id="_234" name="INT8" type="_262" context="_1" location="f1:24" file="f1" line="24"/>
  <Typedef id="_235" name="UINT8" type="_259" context="_1" location="f1:25" file="f1" line="25"/>
  <Typedef id="_236" name="BOOL8" type="_259" context="_1" location="f1:26" file="f1" line="26"/>
  <Typedef id="_237" name="INT16" type="_263" context="_1" location="f1:28" file="f1" line="28"/>
  <Typedef id="_238" name="UINT16" type="_260" context="_1" location="f1:29" file="f1" line="29"/>
  <Typedef id="_239" name="BOOL16" type="_260" context="_1" location="f1:30" file="f1" line="30"/>
  <Typedef id="_240" name="INT32" type="_264" context="_1" location="f1:33" file="f1" line="33"/>
  <Typedef id="_241" name="UINT32" type="_261" context="_1" location="f1:34" file="f1" line="34"/>
  <Typedef id="_242" name="BOOL32" type="_261" context="_1" location="f1:35" file="f1" line="35"/>
  <Typedef id="_243" name="FLOAT32" type="_320" context="_1" location="f1:36" file="f1" line="36"/>
  <Typedef id="_244" name="INT64" type="_319" context="_1" location="f1:38" file="f1" line="38"/>
  <Typedef id="_245" name="UINT64" type="_321" context="_1" location="f1:39" file="f1" line="39"/>
  <Typedef id="_246" name="BOOL64" type="_321" context="_1" location="f1:40" file="f1" line="40"/>
  <Typedef id="_247" name="FLOAT64" type="_322" context="_1" location="f1:41" file="f1" line="41"/>
  <Function id="_248" name="SwapBytes" returns="_304" context="_1" location="f1:43" file="f1" line="43" mangled="_Z9SwapBytes">
    <Argument name="pv" type="_267" location="f1:43" file="f1" line="43"/>
    <Argument name="n" type="_9" location="f1:43" file="f1" line="43"/>
  </Function>
  <Struct id="_249" name="" context="_1" location="f1:56" file="f1" line="56" members="_323 _324 _325 _326 _327 _328 _329 _330 _331 _332 _333 _334 _335 _336 _337 _338 _339 _340 _341 _342 _343 _344 _345 _346 _347 _348 _349 _350 _351 _352 _353 _354" size="2624" align="64"/>
  <Typedef id="_250" name="Data" type="_249" context="_1" location="f1:100" file="f1" line="100"/>
  <Function id="_251" name="main" returns="_264" context="_1" location="f1:102" file="f1" line="102"/>
  <FundamentalType id="_252" name="__int128" size="128" align="128"/>
  <FundamentalType id="_253" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_254" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_355 _356 _357 _358" size="256" align="64"/>
  <PointerType id="_255" type="_359" size="64" align="64"/>
  <CvQualifiedType id="_255r" type="_255" restrict="1"/>
  <ArrayType id="_256" min="0" max="0" type="_360"/>
  <PointerType id="_257" type="_359c" size="64" align="64"/>
  <CvQualifiedType id="_257r" type="_257" restrict="1"/>
  <FundamentalType id="_258" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_259" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_260" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_261" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_262" name="signed char" size="8" align="8"/>
  <FundamentalType id="_263" name="short int" size="16" align="16"/>
  <FundamentalType id="_264" name="int" size="32" align="32"/>
  <FundamentalType id="_265" name="long int" size="64" align="64"/>
  <Field id="_266" name="__val" type="_361" context="_46" access="public" location="f4:153" file="f4" line="153" offset="0"/>
  <PointerType id="_267" type="_304" size="64" align="64"/>
  <CvQualifiedType id="_267r" type="_267" restrict="1"/>
  <Field id="_268" name="__count" type="_264" context="_75" access="public" location="f5:15" file="f5" line="15" offset="0"/>
  <Union id="_269" name="" context="_75" location="f5:16" file="f5" line="16" members="_362 _363" size="32" align="32"/>
  <Field id="_270" name="__value" type="_269" context="_75" access="public" location="f5:20" file="f5" line="20" offset="32"/>
  <Field id="_271" name="__pos" type="_43" context="_77" access="public" location="f6:12" file="f6" line="12" offset="0"/>
  <Field id="_272" name="__state" type="_76" context="_77" access="public" location="f6:13" file="f6" line="13" offset="64"/>
  <Field id="_273" name="__pos" type="_44" context="_79" access="public" location="f7:12" file="f7" line="12" offset="0"/>
  <Field id="_274" name="__state" type="_76" context="_79" access="public" location="f7:13" file="f7" line="13" offset="64"/>
  <Field id="_275" name="_flags" type="_264" context="_81" access="public" location="f8:51" file="f8" line="51" offset="0"/>
  <Field id="_276" name="_IO_read_ptr" type="_255" context="_81" access="public" location="f8:54" file="f8" line="54" offset="64"/>
  <Field id="_277" name="_IO_read_end" type="_255" context="_81" access="public" location="f8:55" file="f8" line="55" offset="128"/>
  <Field id="_278" name="_IO_read_base" type="_255" context="_81" access="public" location="f8:56" file="f8" line="56" offset="192"/>
  <Field id="_279" name="_IO_write_base" type="_255" context="_81" access="public" location="f8:57" file="f8" line="57" offset="256"/>
  <Field id="_280" name="_IO_write_ptr" type="_255" context="_81" access="public" location="f8:58" file="f8" line="58" offset="320"/>
  <Field id="_281" name="_IO_write_end" type="_255" context="_81" access="public" location="f8:59" file="f8" line="59" offset="384"/>
  <Field id="_282" name="_IO_buf_base" type="_255" context="_81" access="public" location="f8:60" file="f8" line="60" offset="448"/>
  <Field id="_283" name="_IO_buf_end" type="_255" context="_81" access="public" location="f8:61" file="f8" line="61" offset="512"/>
  <Field id="_284" name="_IO_save_base" type="_255" context="_81" access="public" location="f8:64" file="f8" line="64" offset="576"/>
  <Field id="_285" name="_IO_backup_base" type="_255" context="_81" access="public" location="f8:65" file="f8" line="65" offset="640"/>
  <Field id="_286" name="_IO_save_end" type="_255" context="_81" access="public" location="f8:66" file="f8" line="66" offset="704"/>
  <Field id="_287" name="_markers" type="_364" context="_81" access="public" location="f8:68" file="f8" line="68" offset="768"/>
  <Field id="_288" name="_chain" type="_365" context="_81" access="public" location="f8:70" file="f8" line="70" offset="832"/>
  <Field id="_289" name="_fileno" type="_264" context="_81" access="public" location="f8:72" file="f8" line="72" offset="896"/>
  <Field id="_290" name="_flags2" type="_264" context="_81" access="public" location="f8:73" file="f8" line="73" offset="928"/>
  <Field id="_291" name="_old_offset" type="_43" context="_81" access="public" location="f8:74" file="f8" line="74" offset="960"/>
  <Field id="_292" name="_cur_column" type="_260" context="_81" access="public" location="f8:77" file="f8" line="77" offset="1024"/>
  <Field id="_293" name="_vtable_offset" type="_262" context="_81" access="public" location="f8:78" file="f8" line="78" offset="1040"/>
  <Field id="_294" name="_shortbuf" type="_366" context="_81" access="public" location="f8:79" file="f8" line="79" offset="1048"/>
  <Field id="_295" name="_lock" type="_367" context="_81" access="public" location="f8:81" file="f8" line="81" offset="1088"/>
  <Field id="_296" name="_offset" type="_44" context="_81" access="public" location="f8:89" file="f8" line="89" offset="1152"/>
  <Field id="_297" name="_codecvt" type="_368" context="_81" access="public" location="f8:91" file="f8" line="91" offset="1216"/>
  <Field id="_298" name="_wide_data" type="_369" context="_81" access="public" location="f8:92" file="f8" line="92" offset="1280"/>
  <Field id="_299" name="_freeres_list" type="_365" context="_81" access="public" location="f8:93" file="f8" line="93" offset="1344"/>
  <Field id="_300" name="_freeres_buf" type="_267" context="_81" access="public" location="f8:94" file="f8" line="94" offset="1408"/>
  <Field id="_301" name="__pad5" type="_9" context="_81" access="public" location="f8:95" file="f8" line="95" offset="1472"/>
  <Field id="_302" name="_mode" type="_264" context="_81" access="public" location="f8:96" file="f8" line="96" offset="1536"/>
  <Field id="_303" name="_unused2" type="_370" context="_81" access="public" location="f8:98" file="f8" line="98" offset="1568"/>
  <FundamentalType id="_304" name="void" size="0" align="8"/>
  <PointerType id="_305" type="_83" size="64" align="64"/>
  <CvQualifiedType id="_305r" type="_305" restrict="1"/>
  <PointerType id="_306" type="_255" size="64" align="64"/>
  <CvQualifiedType id="_306r" type="_306" restrict="1"/>
  <PointerType id="_307" type="_9" size="64" align="64"/>
  <CvQualifiedType id="_307r" type="_307" restrict="1"/>
  <PointerType id="_308" type="_360" size="64" align="64"/>
  <PointerType id="_309" type="_304c" size="64" align="64"/>
  <CvQualifiedType id="_304c" type="_304" const="1"/>
  <CvQualifiedType id="_309r" type="_309" restrict="1"/>
  <PointerType id="_310" type="_90" size="64" align="64"/>
  <CvQualifiedType id="_310r" type="_310" restrict="1"/>
  <PointerType id="_311" type="_90c" size="64" align="64"/>
  <CvQualifiedType id="_90c" type="_90" const="1"/>
  <ArrayType id="_312" min="0" max="" type="_257c"/>
  <CvQualifiedType id="_257c" type="_257" const="1"/>
  <Field id="_313" name="__locales" type="_371" context="_194" access="public" location="f14:31" file="f14" line="31" offset="0"/>
  <Field id="_314" name="__ctype_b" type="_372" context="_194" access="public" location="f14:34" file="f14" line="34" offset="832"/>
  <Field id="_315" name="__ctype_tolower" type="_373" context="_194" access="public" location="f14:35" file="f14" line="35" offset="896"/>
  <Field id="_316" name="__ctype_toupper" type="_373" context="_194" access="public" location="f14:36" file="f14" line="36" offset="960"/>
  <Field id="_317" name="__names" type="_374" context="_194" access="public" location="f14:39" file="f14" line="39" offset="1024"/>
  <PointerType id="_318" type="_194" size="64" align="64"/>
  <FundamentalType id="_319" name="long long int" size="64" align="64"/>
  <FundamentalType id="_320" name="float" size="32" align="32"/>
  <FundamentalType id="_321" name="long long unsigned int" size="64" align="64"/>
  <FundamentalType id="_322" name="double" size="64" align="64"/>
  <Field id="_323" name="int8_low" type="_234" context="_249" access="public" location="f1:58" file="f1" line="58" offset="0"/>
  <Field id="_324" name="int8_high" type="_234" context="_249" access="public" location="f1:59" file="f1" line="59" offset="8"/>
  <Field id="_325" name="uint8_low" type="_235" context="_249" access="public" location="f1:60" file="f1" line="60" offset="16"/>
  <Field id="_326" name="uint8_high" type="_235" context="_249" access="public" location="f1:61" file="f1" line="61" offset="24"/>
  <Field id="_327" name="bool8_false" type="_236" context="_249" access="public" location="f1:62" file="f1" line="62" offset="32"/>
  <Field id="_328" name="bool8_true" type="_236" context="_249" access="public" location="f1:63" file="f1" line="63" offset="40"/>
  <Field id="_329" name="int16_low" type="_237" context="_249" access="public" location="f1:66" file="f1" line="66" offset="48"/>
  <Field id="_330" name="int16_high" type="_237" context="_249" access="public" location="f1:67" file="f1" line="67" offset="64"/>
  <Field id="_331" name="uint16_low" type="_238" context="_249" access="public" location="f1:68" file="f1" line="68" offset="80"/>
  <Field id="_332" name="uint16_high" type="_238" context="_249" access="public" location="f1:69" file="f1" line="69" offset="96"/>
  <Field id="_333" name="bool16_false" type="_239" context="_249" access="public" location="f1:70" file="f1" line="70" offset="112"/>
  <Field id="_334" name="bool16_true" type="_239" context="_249" access="public" location="f1:71" file="f1" line="71" offset="128"/>
  <Field id="_335" name="int32_low" type="_240" context="_249" access="public" location="f1:74" file="f1" line="74" offset="160"/>
  <Field id="_336" name="int32_high" type="_240" context="_249" access="public" location="f1:75" file="f1" line="75" offset="192"/>
  <Field id="_337" name="uint32_low" type="_241" context="_249" access="public" location="f1:76" file="f1" line="76" offset="224"/>
  <Field id="_338" name="uint32_high" type="_241" context="_249" access="public" location="f1:77" file="f1" line="77" offset="256"/>
  <Field id="_339" name="bool32_false" type="_242" context="_249" access="public" location="f1:78" file="f1" line="78" offset="288"/>
  <Field id="_340" name="bool32_true" type="_242" context="_249" access="public" location="f1:79" file="f1" line="79" offset="320"/>
  <Field id="_341" name="float32_low" type="_243" context="_249" access="public" location="f1:80" file="f1" line="80" offset="352"/>
  <Field id="_342" name="float32_high" type="_243" context="_249" access="public" location="f1:81" file="f1" line="81" offset="384"/>
  <Field id="_343" name="int64_low" type="_244" context="_249" access="public" location="f1:84" file="f1" line="84" offset="448"/>
  <Field id="_344" name="int64_high" type="_244" context="_249" access="public" location="f1:85" file="f1" line="85" offset="512"/>
  <Field id="_345" name="uint64_low" type="_245" context="_249" access="public" location="f1:86" file="f1" line="86" offset="576"/>
  <Field id="_346" name="uint64_high" type="_245" context="_249" access="public" location="f1:87" file="f1" line="87" offset="640"/>
  <Field id="_347" name="bool64_false" type="_246" context="_249" access="public" location="f1:88" file="f1" line="88" offset="704"/>
  <Field id="_348" name="bool64_true" type="_246" context="_249" access="public" location="f1:89" file="f1" line="89" offset="768"/>
  <Field id="_349" name="float64_low" type="_247" context="_249" access="public" location="f1:90" file="f1" line="90" offset="832"/>
  <Field id="_350" name="float64_high" type="_247" context="_249" access="public" location="f1:91" file="f1" line="91" offset="896"/>
  <Field id="_351" name="int32_array" type="_375" context="_249" access="public" location="f1:94" file="f1" line="94" offset="960"/>
  <Field id="_352" name="utf8_ascii" type="_376" context="_249" access="public" location="f1:97" file="f1" line="97" offset="1120"/>
  <Field id="_353" name="utf8_nonascii" type="_377" context="_249" access="public" location="f1:98" file="f1" line="98" offset="1920"/>
  <Field id="_354" name="utf8_no_term" type="_378" context="_249" access="public" location="f1:99" file="f1" line="99" offset="2560"/>
  <Field id="_355" name="isa" type="_373" context="_254" access="public" offset="0"/>
  <Field id="_356" name="flags" type="_264" context="_254" access="public" offset="64"/>
  <Field id="_357" name="str" type="_257" context="_254" access="public" offset="128"/>
  <Field id="_358" name="length" type="_265" context="_254" access="public" offset="192"/>
  <CvQualifiedType id="_359c" type="_359" const="1"/>
  <Struct id="_360" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_379 _380 _381 _382" size="192" align="64"/>
  <ArrayType id="_361" min="0" max="1" type="_264"/>
  <Field id="_362" name="__wch" type="_261" context="_269" access="public" location="f5:18" file="f5" line="18" offset="0"/>
  <Field id="_363" name="__wchb" type="_378" context="_269" access="public" location="f5:19" file="f5" line="19" offset="0"/>
  <PointerType id="_364" type="_84" size="64" align="64"/>
  <PointerType id="_365" type="_81" size="64" align="64"/>
  <ArrayType id="_366" min="0" max="0" type="_359"/>
  <FundamentalType id="_359" name="char" size="8" align="8"/>
  <PointerType id="_367" type="_87" size="64" align="64"/>
  <PointerType id="_368" type="_85" size="64" align="64"/>
  <PointerType id="_369" type="_86" size="64" align="64"/>
  <ArrayType id="_370" min="0" max="19" type="_359"/>
  <ArrayType id="_371" min="0" max="12" type="_383"/>
  <PointerType id="_372" type="_260c" size="64" align="64"/>
  <CvQualifiedType id="_260c" type="_260" const="1"/>
  <PointerType id="_373" type="_264c" size="64" align="64"/>
  <CvQualifiedType id="_264c" type="_264" const="1"/>
  <ArrayType id="_374" min="0" max="12" type="_257"/>
  <ArrayType id="_375" min="0" max="4" type="_240"/>
  <ArrayType id="_376" min="0" max="99" type="_359"/>
  <ArrayType id="_377" min="0" max="79" type="_359"/>
  <ArrayType id="_378" min="0" max="3" type="_359"/>
  <Field id="_379" name="gp_offset" type="_261" context="_360" access="public" offset="0"/>
  <Field id="_380" name="fp_offset" type="_261" context="_360" access="public" offset="32"/>
  <Field id="_381" name="overflow_arg_area" type="_267" context="_360" access="public" offset="64"/>
  <Field id="_382" name="reg_save_area" type="_267" context="_360" access="public" offset="128"/>
  <PointerType id="_383" type="_384" size="64" align="64"/>
  <Struct id="_384" name="__locale_data" context="_1" location="f14:31" file="f14" line="31" incomplete="1"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="savestruct.c"/>
  <File id="f2" name="/home/joelmidstjarna/castxml/share/castxml/clang/include/stddef.h"/>
  <File id="f3" name="/home/joelmidstjarna/castxml/share/castxml/clang/include/stdarg.h"/>
  <File id="f4" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f5" name="/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h"/>
  <File id="f6" name="/usr/include/x86_64-linux-gnu/bits/types/__fpos_t.h"/>
  <File id="f7" name="/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h"/>
  <File id="f8" name="/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h"/>
  <File id="f9" name="/usr/include/x86_64-linux-gnu/bits/types/__FILE.h"/>
  <File id="f10" name="/usr/include/x86_64-linux-gnu/bits/types/FILE.h"/>
  <File id="f11" name="/usr/include/stdio.h"/>
  <File id="f12" name="/usr/include/x86_64-linux-gnu/bits/sys_errlist.h"/>
  <File id="f13" name="/usr/include/string.h"/>
  <File id="f14" name="/usr/include/x86_64-linux-gnu/bits/types/__locale_t.h"/>
  <File id="f15" name="/usr/include/x86_64-linux-gnu/bits/types/locale_t.h"/>
  <File id="f16" name="/usr/include/strings.h"/>
</GCC_XML>
