<?xml version="1.0"?>
<CastXML format="1.1.5">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76 _77 _78 _79 _80 _81 _82 _83 _84 _85 _86 _87 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _129 _130 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _159 _160 _161 _162 _163 _164 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _199 _200 _201 _202 _203 _204 _205 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _216 _217 _218 _219 _220 _221 _222 _223 _224 _225 _226 _227 _228 _229 _230 _231 _232 _233 _234 _235 _236 _237 _238 _239 _240 _241 _242 _243 _244 _245 _246 _247 _248 _249 _250 _251 _252 _253 _254 _255 _256 _257 _258 _259 _260"/>
  <Typedef id="_2" name="__int128_t" type="_261" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_262" context="_1" location="f0:0" file="f0" line="0"/>

  <Function id="_232" name="index" returns="_264" context="_1" location="f9:484" file="f9" line="484" extern="1" artificial="1" mangled="_Z5index">
    <Argument type="_328"/>
    <Argument type="_272"/>
  </Function>
  <Function id="_233" name="rindex" returns="_264" context="_1" location="f9:512" file="f9" line="512" extern="1" artificial="1" mangled="_Z6rindex">
    <Argument type="_328"/>
    <Argument type="_272"/>
  </Function>
  <Function id="_234" name="ffs" returns="_272" context="_1" location="f9:518" file="f9" line="518" extern="1" mangled="_Z3ffs">
    <Argument name="__i" type="_272" location="f9:518" file="f9" line="518"/>
  </Function>
  <Function id="_235" name="strcasecmp" returns="_272" context="_1" location="f9:529" file="f9" line="529" extern="1" artificial="1" mangled="_Z10strcasecmp">
    <Argument type="_328"/>
    <Argument type="_328"/>
  </Function>
  <Function id="_236" name="strncasecmp" returns="_272" context="_1" location="f9:533" file="f9" line="533" extern="1" artificial="1" mangled="_Z11strncasecmp">
    <Argument type="_328"/>
    <Argument type="_328"/>
    <Argument type="_266"/>
  </Function>
  <Function id="_237" name="strsep" returns="_264" context="_1" location="f9:552" file="f9" line="552" extern="1" mangled="_Z6strsep">
    <Argument name="__stringp" type="_333r" location="f9:552" file="f9" line="552"/>
    <Argument name="__delim" type="_328r" location="f9:553" file="f9" line="553"/>
  </Function>
  <Function id="_238" name="strsignal" returns="_264" context="_1" location="f9:559" file="f9" line="559" extern="1" mangled="_Z9strsignal">
    <Argument name="__sig" type="_272" location="f9:559" file="f9" line="559"/>
  </Function>
  <Function id="_239" name="__stpcpy" returns="_264" context="_1" location="f9:562" file="f9" line="562" extern="1" mangled="_Z8__stpcpy">
    <Argument name="__dest" type="_264r" location="f9:562" file="f9" line="562"/>
    <Argument name="__src" type="_328r" location="f9:562" file="f9" line="562"/>
  </Function>
  <Function id="_240" name="stpcpy" returns="_264" context="_1" location="f9:564" file="f9" line="564" extern="1" artificial="1" mangled="_Z6stpcpy">
    <Argument type="_264"/>
    <Argument type="_328"/>
  </Function>
  <Function id="_241" name="__stpncpy" returns="_264" context="_1" location="f9:569" file="f9" line="569" extern="1" mangled="_Z9__stpncpy">
    <Argument name="__dest" type="_264r" location="f9:569" file="f9" line="569"/>
    <Argument name="__src" type="_328r" location="f9:570" file="f9" line="570"/>
    <Argument name="__n" type="_7" location="f9:570" file="f9" line="570"/>
  </Function>
  <Function id="_242" name="stpncpy" returns="_264" context="_1" location="f9:572" file="f9" line="572" extern="1" artificial="1" mangled="_Z7stpncpy">
    <Argument type="_264"/>
    <Argument type="_328"/>
    <Argument type="_266"/>
  </Function>
  <Typedef id="_243" name="INT8" type="_270" context="_1" location="f11:12" file="f11" line="12"/>
  <Typedef id="_244" name="UINT8" type="_267" context="_1" location="f11:13" file="f11" line="13"/>
  <Typedef id="_245" name="BOOL8" type="_267" context="_1" location="f11:14" file="f11" line="14"/>
  <Typedef id="_246" name="INT16" type="_271" context="_1" location="f11:16" file="f11" line="16"/>
  <Typedef id="_247" name="UINT16" type="_268" context="_1" location="f11:17" file="f11" line="17"/>
  <Typedef id="_248" name="BOOL16" type="_268" context="_1" location="f11:18" file="f11" line="18"/>
  <Typedef id="_249" name="INT32" type="_272" context="_1" location="f11:21" file="f11" line="21"/>
  <Typedef id="_250" name="UINT32" type="_269" context="_1" location="f11:22" file="f11" line="22"/>
  <Typedef id="_251" name="BOOL32" type="_269" context="_1" location="f11:23" file="f11" line="23"/>
  <Typedef id="_252" name="FLOAT32" type="_345" context="_1" location="f11:24" file="f11" line="24"/>
  <Typedef id="_253" name="INT64" type="_346" context="_1" location="f11:26" file="f11" line="26"/>
  <Typedef id="_254" name="UINT64" type="_347" context="_1" location="f11:27" file="f11" line="27"/>
  <Typedef id="_255" name="BOOL64" type="_347" context="_1" location="f11:28" file="f11" line="28"/>
  <Typedef id="_256" name="FLOAT64" type="_348" context="_1" location="f11:29" file="f11" line="29"/>
  <Function id="_257" name="SwapBytes" returns="_318" context="_1" location="f11:31" file="f11" line="31" mangled="_Z9SwapBytes">
    <Argument name="pv" type="_276" location="f11:31" file="f11" line="31"/>
    <Argument name="n" type="_7" location="f11:31" file="f11" line="31"/>
  </Function>
  <Struct id="_258" name="" context="_1" location="f11:44" file="f11" line="44" members="_349 _350 _351 _352 _353 _354 _355 _356 _357 _358 _359 _360 _361 _362 _363 _364 _365 _366 _367 _368 _369 _370 _371 _372 _373 _374 _375 _376 _377 _378 _379 _380" size="2544" align="8"/>
  <Typedef id="_259" name="Data" type="_381" context="_1" location="f11:88" file="f11" line="88"/>
  <Function id="_260" name="main" returns="_318" context="_1" location="f11:90" file="f11" line="90"/>
  <FundamentalType id="_261" name="__int128" size="128" align="128"/>
  <FundamentalType id="_262" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_263" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_382 _383 _384 _385" size="256" align="64"/>
  <PointerType id="_264" type="_386" size="64" align="64"/>
  <CvQualifiedType id="_264r" type="_264" restrict="1"/>
  <ArrayType id="_265" min="0" max="0" type="_387"/>
  <FundamentalType id="_266" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_267" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_268" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_269" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_270" name="signed char" size="8" align="8"/>
  <FundamentalType id="_271" name="short int" size="16" align="16"/>
  <FundamentalType id="_272" name="int" size="32" align="32"/>
  <FundamentalType id="_273" name="long int" size="64" align="64"/>
  <Field id="_274" name="__val" type="_388" context="_32" access="public" location="f2:134" file="f2" line="134" offset="0"/>
  <ElaboratedType id="_275" type="_32"/>
  <PointerType id="_276" type="_318" size="64" align="64"/>
  <CvQualifiedType id="_276r" type="_276" restrict="1"/>
  <PointerType id="_277" type="_20" size="64" align="64"/>
  <Field id="_278" name="_flags" type="_272" context="_61" access="public" location="f3:242" file="f3" line="242" offset="0"/>
  <Field id="_279" name="_IO_read_ptr" type="_264" context="_61" access="public" location="f3:247" file="f3" line="247" offset="32"/>
  <Field id="_280" name="_IO_read_end" type="_264" context="_61" access="public" location="f3:248" file="f3" line="248" offset="96"/>
  <Field id="_281" name="_IO_read_base" type="_264" context="_61" access="public" location="f3:249" file="f3" line="249" offset="160"/>
  <Field id="_282" name="_IO_write_base" type="_264" context="_61" access="public" location="f3:250" file="f3" line="250" offset="224"/>
  <Field id="_283" name="_IO_write_ptr" type="_264" context="_61" access="public" location="f3:251" file="f3" line="251" offset="288"/>
  <Field id="_284" name="_IO_write_end" type="_264" context="_61" access="public" location="f3:252" file="f3" line="252" offset="352"/>
  <Field id="_285" name="_IO_buf_base" type="_264" context="_61" access="public" location="f3:253" file="f3" line="253" offset="416"/>
  <Field id="_286" name="_IO_buf_end" type="_264" context="_61" access="public" location="f3:254" file="f3" line="254" offset="480"/>
  <Field id="_287" name="_IO_save_base" type="_264" context="_61" access="public" location="f3:256" file="f3" line="256" offset="544"/>
  <Field id="_288" name="_IO_backup_base" type="_264" context="_61" access="public" location="f3:257" file="f3" line="257" offset="608"/>
  <Field id="_289" name="_IO_save_end" type="_264" context="_61" access="public" location="f3:258" file="f3" line="258" offset="672"/>
  <Field id="_290" name="_markers" type="_389" context="_61" access="public" location="f3:260" file="f3" line="260" offset="736"/>
  <Field id="_291" name="_chain" type="_331" context="_61" access="public" location="f3:262" file="f3" line="262" offset="800"/>
  <Field id="_292" name="_fileno" type="_272" context="_61" access="public" location="f3:264" file="f3" line="264" offset="864"/>
  <Field id="_293" name="_flags2" type="_272" context="_61" access="public" location="f3:268" file="f3" line="268" offset="896"/>
  <Field id="_294" name="_old_offset" type="_29" context="_61" access="public" location="f3:270" file="f3" line="270" offset="928"/>
  <Field id="_295" name="_cur_column" type="_268" context="_61" access="public" location="f3:274" file="f3" line="274" offset="992"/>
  <Field id="_296" name="_vtable_offset" type="_270" context="_61" access="public" location="f3:275" file="f3" line="275" offset="1008"/>
  <Field id="_297" name="_shortbuf" type="_390" context="_61" access="public" location="f3:276" file="f3" line="276" offset="1016"/>
  <Field id="_298" name="_lock" type="_391" context="_61" access="public" location="f3:280" file="f3" line="280" offset="1024"/>
  <Field id="_299" name="_offset" type="_30" context="_61" access="public" location="f3:289" file="f3" line="289" offset="1088"/>
  <Field id="_300" name="__pad1" type="_276" context="_61" access="public" location="f3:297" file="f3" line="297" offset="1152"/>
  <Field id="_301" name="__pad2" type="_276" context="_61" access="public" location="f3:298" file="f3" line="298" offset="1216"/>
  <Field id="_302" name="__pad3" type="_276" context="_61" access="public" location="f3:299" file="f3" line="299" offset="1280"/>
  <Field id="_303" name="__pad4" type="_276" context="_61" access="public" location="f3:300" file="f3" line="300" offset="1344"/>
  <Field id="_304" name="__pad5" type="_7" context="_61" access="public" location="f3:302" file="f3" line="302" offset="1408"/>
  <Field id="_305" name="_mode" type="_272" context="_61" access="public" location="f3:303" file="f3" line="303" offset="1472"/>
  <Field id="_306" name="_unused2" type="_392" context="_61" access="public" location="f3:305" file="f3" line="305" offset="1504"/>
  <ElaboratedType id="_307" type="_61"/>
  <Field id="_308" name="__count" type="_272" context="_64" access="public" location="f5:84" file="f5" line="84" offset="0"/>
  <Union id="_309" name="" context="_64" location="f5:85" file="f5" line="85" members="_393 _394" size="32" align="8"/>
  <Field id="_310" name="__value" type="_395" context="_64" access="public" location="f5:93" file="f5" line="93" offset="32"/>
  <ElaboratedType id="_311" type="_64"/>
  <Field id="_312" name="__pos" type="_29" context="_66" access="public" location="f6:23" file="f6" line="23" offset="0"/>
  <Field id="_313" name="__state" type="_65" context="_66" access="public" location="f6:24" file="f6" line="24" offset="64"/>
  <ElaboratedType id="_314" type="_66"/>
  <Field id="_315" name="__pos" type="_30" context="_68" access="public" location="f6:28" file="f6" line="28" offset="0"/>
  <Field id="_316" name="__state" type="_65" context="_68" access="public" location="f6:29" file="f6" line="29" offset="64"/>
  <ElaboratedType id="_317" type="_68"/>
  <FundamentalType id="_318" name="void" size="0" align="8"/>
  <Field id="_319" name="_next" type="_389" context="_74" access="public" location="f3:157" file="f3" line="157" offset="0"/>
  <Field id="_320" name="_sbuf" type="_331" context="_74" access="public" location="f3:158" file="f3" line="158" offset="64"/>
  <Field id="_321" name="_pos" type="_272" context="_74" access="public" location="f3:162" file="f3" line="162" offset="128"/>
  <ElaboratedType id="_322" type="_77"/>
  <FunctionType id="_323" returns="_53">
    <Argument type="_276"/>
    <Argument type="_264"/>
    <Argument type="_7"/>
  </FunctionType>
  <FunctionType id="_324" returns="_53">
    <Argument type="_276"/>
    <Argument type="_328"/>
    <Argument type="_7"/>
  </FunctionType>
  <FunctionType id="_325" returns="_272">
    <Argument type="_276"/>
    <Argument type="_396"/>
    <Argument type="_272"/>
  </FunctionType>
  <FunctionType id="_326" returns="_272">
    <Argument type="_276"/>
  </FunctionType>
  <PointerType id="_327" type="_76" size="64" align="64"/>
  <CvQualifiedType id="_327r" type="_327" restrict="1"/>
  <PointerType id="_328" type="_386c" size="64" align="64"/>
  <CvQualifiedType id="_328r" type="_328" restrict="1"/>
  <PointerType id="_329" type="_387" size="64" align="64"/>
  <PointerType id="_330" type="_272" size="64" align="64"/>
  <CvQualifiedType id="_330r" type="_330" restrict="1"/>
  <PointerType id="_331" type="_307" size="64" align="64"/>
  <PointerType id="_332" type="_62" size="64" align="64"/>
  <CvQualifiedType id="_332r" type="_332" restrict="1"/>
  <PointerType id="_333" type="_264" size="64" align="64"/>
  <CvQualifiedType id="_333r" type="_333" restrict="1"/>
  <PointerType id="_334" type="_7" size="64" align="64"/>
  <CvQualifiedType id="_334r" type="_334" restrict="1"/>
  <PointerType id="_335" type="_318c" size="64" align="64"/>
  <CvQualifiedType id="_318c" type="_318" const="1"/>
  <CvQualifiedType id="_335r" type="_335" restrict="1"/>
  <PointerType id="_336" type="_105" size="64" align="64"/>
  <CvQualifiedType id="_336r" type="_336" restrict="1"/>
  <PointerType id="_337" type="_105c" size="64" align="64"/>
  <CvQualifiedType id="_105c" type="_105" const="1"/>
  <ArrayType id="_338" min="0" max="" type="_328c"/>
  <CvQualifiedType id="_328c" type="_328" const="1"/>
  <Field id="_339" name="__locales" type="_397" context="_207" access="public" location="f10:30" file="f10" line="30" offset="0"/>
  <Field id="_340" name="__ctype_b" type="_398" context="_207" access="public" location="f10:33" file="f10" line="33" offset="832"/>
  <Field id="_341" name="__ctype_tolower" type="_399" context="_207" access="public" location="f10:34" file="f10" line="34" offset="896"/>
  <Field id="_342" name="__ctype_toupper" type="_399" context="_207" access="public" location="f10:35" file="f10" line="35" offset="960"/>
  <Field id="_343" name="__names" type="_400" context="_207" access="public" location="f10:38" file="f10" line="38" offset="1024"/>
  <PointerType id="_344" type="_401" size="64" align="64"/>
  <FundamentalType id="_345" name="float" size="32" align="32"/>
  <FundamentalType id="_346" name="long long int" size="64" align="64"/>
  <FundamentalType id="_347" name="long long unsigned int" size="64" align="64"/>
  <FundamentalType id="_348" name="double" size="64" align="64"/>
  <Field id="_349" name="int8_low" type="_243" context="_258" access="public" location="f11:46" file="f11" line="46" offset="0"/>
  <Field id="_350" name="int8_high" type="_243" context="_258" access="public" location="f11:47" file="f11" line="47" offset="8"/>
  <Field id="_351" name="uint8_low" type="_244" context="_258" access="public" location="f11:48" file="f11" line="48" offset="16"/>
  <Field id="_352" name="uint8_high" type="_244" context="_258" access="public" location="f11:49" file="f11" line="49" offset="24"/>
  <Field id="_353" name="bool8_false" type="_245" context="_258" access="public" location="f11:50" file="f11" line="50" offset="32"/>
  <Field id="_354" name="bool8_true" type="_245" context="_258" access="public" location="f11:51" file="f11" line="51" offset="40"/>
  <Field id="_355" name="int16_low" type="_246" context="_258" access="public" location="f11:54" file="f11" line="54" offset="48"/>
  <Field id="_356" name="int16_high" type="_246" context="_258" access="public" location="f11:55" file="f11" line="55" offset="64"/>
  <Field id="_357" name="uint16_low" type="_247" context="_258" access="public" location="f11:56" file="f11" line="56" offset="80"/>
  <Field id="_358" name="uint16_high" type="_247" context="_258" access="public" location="f11:57" file="f11" line="57" offset="96"/>
  <Field id="_359" name="bool16_false" type="_248" context="_258" access="public" location="f11:58" file="f11" line="58" offset="112"/>
  <Field id="_360" name="bool16_true" type="_248" context="_258" access="public" location="f11:59" file="f11" line="59" offset="128"/>
  <Field id="_361" name="int32_low" type="_249" context="_258" access="public" location="f11:62" file="f11" line="62" offset="144"/>
  <Field id="_362" name="int32_high" type="_249" context="_258" access="public" location="f11:63" file="f11" line="63" offset="176"/>
  <Field id="_363" name="uint32_low" type="_250" context="_258" access="public" location="f11:64" file="f11" line="64" offset="208"/>
  <Field id="_364" name="uint32_high" type="_250" context="_258" access="public" location="f11:65" file="f11" line="65" offset="240"/>
  <Field id="_365" name="bool32_false" type="_251" context="_258" access="public" location="f11:66" file="f11" line="66" offset="272"/>
  <Field id="_366" name="bool32_true" type="_251" context="_258" access="public" location="f11:67" file="f11" line="67" offset="304"/>
  <Field id="_367" name="float32_low" type="_252" context="_258" access="public" location="f11:68" file="f11" line="68" offset="336"/>
  <Field id="_368" name="float32_high" type="_252" context="_258" access="public" location="f11:69" file="f11" line="69" offset="368"/>
  <Field id="_369" name="int64_low" type="_253" context="_258" access="public" location="f11:72" file="f11" line="72" offset="400"/>
  <Field id="_370" name="int64_high" type="_253" context="_258" access="public" location="f11:73" file="f11" line="73" offset="464"/>
  <Field id="_371" name="uint64_low" type="_254" context="_258" access="public" location="f11:74" file="f11" line="74" offset="528"/>
  <Field id="_372" name="uint64_high" type="_254" context="_258" access="public" location="f11:75" file="f11" line="75" offset="592"/>
  <Field id="_373" name="bool64_false" type="_255" context="_258" access="public" location="f11:76" file="f11" line="76" offset="656"/>
  <Field id="_374" name="bool64_true" type="_255" context="_258" access="public" location="f11:77" file="f11" line="77" offset="720"/>
  <Field id="_375" name="float64_low" type="_256" context="_258" access="public" location="f11:78" file="f11" line="78" offset="784"/>
  <Field id="_376" name="float64_high" type="_256" context="_258" access="public" location="f11:79" file="f11" line="79" offset="848"/>
  <Field id="_377" name="int32_array" type="_402" context="_258" access="public" location="f11:82" file="f11" line="82" offset="912"/>
  <Field id="_378" name="utf8_ascii" type="_403" context="_258" access="public" location="f11:85" file="f11" line="85" offset="1072"/>
  <Field id="_379" name="utf8_nonascii" type="_404" context="_258" access="public" location="f11:86" file="f11" line="86" offset="1872"/>
  <Field id="_380" name="utf8_no_term" type="_405" context="_258" access="public" location="f11:87" file="f11" line="87" offset="2512"/>
  <ElaboratedType id="_381" type="_258"/>
  <Field id="_382" name="isa" type="_399" context="_263" access="public" offset="0"/>
  <Field id="_383" name="flags" type="_272" context="_263" access="public" offset="64"/>
  <Field id="_384" name="str" type="_328" context="_263" access="public" offset="128"/>
  <Field id="_385" name="length" type="_273" context="_263" access="public" offset="192"/>
  <CvQualifiedType id="_386c" type="_386" const="1"/>
  <Struct id="_387" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_406 _407 _408 _409" size="192" align="64"/>
  <ArrayType id="_388" min="0" max="1" type="_272"/>
  <PointerType id="_389" type="_410" size="64" align="64"/>
  <ArrayType id="_390" min="0" max="0" type="_386"/>
  <FundamentalType id="_386" name="char" size="8" align="8"/>
  <PointerType id="_391" type="_73" size="64" align="64"/>
  <ArrayType id="_392" min="0" max="19" type="_386"/>
  <Field id="_393" name="__wch" type="_269" context="_309" access="public" location="f5:88" file="f5" line="88" offset="0"/>
  <Field id="_394" name="__wchb" type="_405" context="_309" access="public" location="f5:92" file="f5" line="92" offset="0"/>
  <ElaboratedType id="_395" type="_309"/>
  <PointerType id="_396" type="_30" size="64" align="64"/>
  <ArrayType id="_397" min="0" max="12" type="_411"/>
  <PointerType id="_398" type="_268c" size="64" align="64"/>
  <CvQualifiedType id="_268c" type="_268" const="1"/>
  <PointerType id="_399" type="_272c" size="64" align="64"/>
  <CvQualifiedType id="_272c" type="_272" const="1"/>
  <ArrayType id="_400" min="0" max="12" type="_328"/>
  <ArrayType id="_402" min="0" max="4" type="_249"/>
  <ArrayType id="_403" min="0" max="99" type="_386"/>
  <ArrayType id="_404" min="0" max="79" type="_386"/>
  <ArrayType id="_405" min="0" max="3" type="_386"/>
  <Field id="_406" name="gp_offset" type="_269" context="_387" access="public" offset="0"/>
  <Field id="_407" name="fp_offset" type="_269" context="_387" access="public" offset="32"/>
  <Field id="_408" name="overflow_arg_area" type="_276" context="_387" access="public" offset="64"/>
  <Field id="_409" name="reg_save_area" type="_276" context="_387" access="public" offset="128"/>
  <PointerType id="_411" type="_412" size="64" align="64"/>
  <ElaboratedType id="_401" type="_207"/>
  <ElaboratedType id="_410" type="_74"/>
  <ElaboratedType id="_412" type="_413"/>
  <Struct id="_413" name="__locale_data" context="_1" location="f10:30" file="f10" line="30" incomplete="1"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/home/joelmidstjarna/tmp/castxml-linux.tar.gz/castxml/share/castxml/clang/include/stddef.h"/>
  <File id="f2" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f3" name="/usr/include/libio.h"/>
  <File id="f4" name="/usr/include/stdio.h"/>
  <File id="f5" name="/usr/include/wchar.h"/>
  <File id="f6" name="/usr/include/_G_config.h"/>
  <File id="f7" name="/home/joelmidstjarna/tmp/castxml-linux.tar.gz/castxml/share/castxml/clang/include/stdarg.h"/>
  <File id="f8" name="/usr/include/x86_64-linux-gnu/bits/sys_errlist.h"/>
  <File id="f9" name="/usr/include/string.h"/>
  <File id="f10" name="/usr/include/xlocale.h"/>
  <File id="f11" name="savestruct.c"/>
</CastXML>
