<?xml version="1.0"?>
<CastXML format="1.1.5">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11"/>
  <Typedef id="_2" name="__int128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="name_conflict" context="_1" location="f1:1" file="f1" line="1" members="_17" size="32" align="32"/>
  <Union id="_8" name="" context="_1" location="f1:5" file="f1" line="5" members="_18 _19" size="32" align="32"/>
  <Typedef id="_9" name="name_conflict" type="_20" context="_1" location="f1:8" file="f1" line="8"/>
  <Struct id="_10" name="non_supported_member" context="_1" location="f1:10" file="f1" line="10" members="_21" size="3200" align="32"/>
  <Struct id="_11" name="with_volatile" context="_1" location="f1:14" file="f1" line="14" members="_22 _23" size="96" align="32"/>
  <FundamentalType id="_12" name="__int128" size="128" align="128"/>
  <FundamentalType id="_13" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_14" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_24 _25 _26 _27" size="256" align="64"/>
  <PointerType id="_15" type="_28" size="64" align="64"/>
  <ArrayType id="_16" min="0" max="0" type="_29"/>
  <Field id="_17" name="member" type="_30" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Field id="_18" name="member1" type="_30" context="_8" access="public" location="f1:6" file="f1" line="6" offset="0"/>
  <Field id="_19" name="member2" type="_30" context="_8" access="public" location="f1:7" file="f1" line="7" offset="0"/>
  <ElaboratedType id="_20" type="_8"/>
  <Field id="_21" name="matrix" type="_31" context="_10" access="public" location="f1:11" file="f1" line="11" offset="0"/>
  <Field id="_22" name="volatile_member" type="_30v" context="_11" access="public" location="f1:15" file="f1" line="15" offset="0"/>
  <Field id="_23" name="volatile_array" type="_32" context="_11" access="public" location="f1:16" file="f1" line="16" offset="32"/>
  <Field id="_24" name="isa" type="_33" context="_14" access="public" offset="0"/>
  <Field id="_25" name="flags" type="_30" context="_14" access="public" offset="64"/>
  <Field id="_26" name="str" type="_34" context="_14" access="public" offset="128"/>
  <Field id="_27" name="length" type="_35" context="_14" access="public" offset="192"/>
  <Struct id="_29" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_36 _37 _38 _39" size="192" align="64"/>
  <FundamentalType id="_30" name="int" size="32" align="32"/>
  <CvQualifiedType id="_30v" type="_30" volatile="1"/>
  <ArrayType id="_31" min="0" max="9" type="_40"/>
  <ArrayType id="_32" min="0" max="1" type="_30v"/>
  <PointerType id="_33" type="_30c" size="64" align="64"/>
  <CvQualifiedType id="_30c" type="_30" const="1"/>
  <PointerType id="_34" type="_28c" size="64" align="64"/>
  <CvQualifiedType id="_28c" type="_28" const="1"/>
  <FundamentalType id="_35" name="long int" size="64" align="64"/>
  <Field id="_36" name="gp_offset" type="_41" context="_29" access="public" offset="0"/>
  <Field id="_37" name="fp_offset" type="_41" context="_29" access="public" offset="32"/>
  <Field id="_38" name="overflow_arg_area" type="_42" context="_29" access="public" offset="64"/>
  <Field id="_39" name="reg_save_area" type="_42" context="_29" access="public" offset="128"/>
  <ArrayType id="_40" min="0" max="9" type="_30"/>
  <FundamentalType id="_41" name="unsigned int" size="32" align="32"/>
  <PointerType id="_42" type="_43" size="64" align="64"/>
  <FundamentalType id="_28" name="char" size="8" align="8"/>
  <FundamentalType id="_43" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="special_cases.h"/>
</CastXML>
