<?xml version="1.0"?>
<CastXML format="1.1.5">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13"/>
  <Typedef id="_2" name="__int128_t" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_16" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_17" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_18" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="name_conflict" context="_1" location="f1:1" file="f1" line="1" members="_19" size="32" align="32"/>
  <Union id="_8" name="" context="_1" location="f1:5" file="f1" line="5" members="_20 _21" size="32" align="32"/>
  <Typedef id="_9" name="name_conflict" type="_22" context="_1" location="f1:8" file="f1" line="8"/>
  <Struct id="_10" name="non_supported_member" context="_1" location="f1:10" file="f1" line="10" members="_23" size="3200" align="32"/>
  <Struct id="_11" name="with_volatile" context="_1" location="f1:14" file="f1" line="14" members="_24 _25" size="96" align="32"/>
  <Enumeration id="_12" name="filled_enum" context="_1" location="f1:19" file="f1" line="19" size="32" align="32">
    <EnumValue name="emem1" init="0"/>
    <EnumValue name="emem2" init="1"/>
    <EnumValue name="emem3" init="2"/>
    <EnumValue name="emem_fill" init="4294967295"/>
  </Enumeration>
  <Enumeration id="_13" name="signed_enum" context="_1" location="f1:26" file="f1" line="26" size="64" align="64">
    <EnumValue name="semem1" init="-1"/>
    <EnumValue name="semem2" init="1"/>
    <EnumValue name="semem3" init="2"/>
    <EnumValue name="semem_fill" init="4294967295"/>
  </Enumeration>
  <FundamentalType id="_14" name="__int128" size="128" align="128"/>
  <FundamentalType id="_15" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_16" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_26 _27 _28 _29" size="256" align="64"/>
  <PointerType id="_17" type="_30" size="64" align="64"/>
  <ArrayType id="_18" min="0" max="0" type="_31"/>
  <Field id="_19" name="member" type="_32" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Field id="_20" name="member1" type="_32" context="_8" access="public" location="f1:6" file="f1" line="6" offset="0"/>
  <Field id="_21" name="member2" type="_32" context="_8" access="public" location="f1:7" file="f1" line="7" offset="0"/>
  <ElaboratedType id="_22" type="_8"/>
  <Field id="_23" name="matrix" type="_33" context="_10" access="public" location="f1:11" file="f1" line="11" offset="0"/>
  <Field id="_24" name="volatile_member" type="_32v" context="_11" access="public" location="f1:15" file="f1" line="15" offset="0"/>
  <Field id="_25" name="volatile_array" type="_34" context="_11" access="public" location="f1:16" file="f1" line="16" offset="32"/>
  <Field id="_26" name="isa" type="_35" context="_16" access="public" offset="0"/>
  <Field id="_27" name="flags" type="_32" context="_16" access="public" offset="64"/>
  <Field id="_28" name="str" type="_36" context="_16" access="public" offset="128"/>
  <Field id="_29" name="length" type="_37" context="_16" access="public" offset="192"/>
  <Struct id="_31" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_38 _39 _40 _41" size="192" align="64"/>
  <FundamentalType id="_32" name="int" size="32" align="32"/>
  <CvQualifiedType id="_32v" type="_32" volatile="1"/>
  <ArrayType id="_33" min="0" max="9" type="_42"/>
  <ArrayType id="_34" min="0" max="1" type="_32v"/>
  <PointerType id="_35" type="_32c" size="64" align="64"/>
  <CvQualifiedType id="_32c" type="_32" const="1"/>
  <PointerType id="_36" type="_30c" size="64" align="64"/>
  <CvQualifiedType id="_30c" type="_30" const="1"/>
  <FundamentalType id="_37" name="long int" size="64" align="64"/>
  <Field id="_38" name="gp_offset" type="_43" context="_31" access="public" offset="0"/>
  <Field id="_39" name="fp_offset" type="_43" context="_31" access="public" offset="32"/>
  <Field id="_40" name="overflow_arg_area" type="_44" context="_31" access="public" offset="64"/>
  <Field id="_41" name="reg_save_area" type="_44" context="_31" access="public" offset="128"/>
  <ArrayType id="_42" min="0" max="9" type="_32"/>
  <FundamentalType id="_43" name="unsigned int" size="32" align="32"/>
  <PointerType id="_44" type="_45" size="64" align="64"/>
  <FundamentalType id="_30" name="char" size="8" align="8"/>
  <FundamentalType id="_45" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="special_cases.h"/>
</CastXML>
