<?xml version="1.0"?>
<CastXML format="1.1.5">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10"/>
  <Typedef id="_2" name="__int128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="name_conflict" context="_1" location="f1:1" file="f1" line="1" members="_16" size="32" align="32"/>
  <Union id="_8" name="" context="_1" location="f1:5" file="f1" line="5" members="_17 _18" size="32" align="32"/>
  <Typedef id="_9" name="name_conflict" type="_19" context="_1" location="f1:8" file="f1" line="8"/>
  <Struct id="_10" name="non_supported_member" context="_1" location="f1:10" file="f1" line="10" members="_20" size="3200" align="32"/>
  <FundamentalType id="_11" name="__int128" size="128" align="128"/>
  <FundamentalType id="_12" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_13" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_21 _22 _23 _24" size="256" align="64"/>
  <PointerType id="_14" type="_25" size="64" align="64"/>
  <ArrayType id="_15" min="0" max="0" type="_26"/>
  <Field id="_16" name="member" type="_27" context="_7" access="public" location="f1:2" file="f1" line="2" offset="0"/>
  <Field id="_17" name="member1" type="_27" context="_8" access="public" location="f1:6" file="f1" line="6" offset="0"/>
  <Field id="_18" name="member2" type="_27" context="_8" access="public" location="f1:7" file="f1" line="7" offset="0"/>
  <ElaboratedType id="_19" type="_8"/>
  <Field id="_20" name="matrix" type="_28" context="_10" access="public" location="f1:11" file="f1" line="11" offset="0"/>
  <Field id="_21" name="isa" type="_29" context="_13" access="public" offset="0"/>
  <Field id="_22" name="flags" type="_27" context="_13" access="public" offset="64"/>
  <Field id="_23" name="str" type="_30" context="_13" access="public" offset="128"/>
  <Field id="_24" name="length" type="_31" context="_13" access="public" offset="192"/>
  <Struct id="_26" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_32 _33 _34 _35" size="192" align="64"/>
  <FundamentalType id="_27" name="int" size="32" align="32"/>
  <ArrayType id="_28" min="0" max="9" type="_36"/>
  <PointerType id="_29" type="_27c" size="64" align="64"/>
  <CvQualifiedType id="_27c" type="_27" const="1"/>
  <PointerType id="_30" type="_25c" size="64" align="64"/>
  <CvQualifiedType id="_25c" type="_25" const="1"/>
  <FundamentalType id="_31" name="long int" size="64" align="64"/>
  <Field id="_32" name="gp_offset" type="_37" context="_26" access="public" offset="0"/>
  <Field id="_33" name="fp_offset" type="_37" context="_26" access="public" offset="32"/>
  <Field id="_34" name="overflow_arg_area" type="_38" context="_26" access="public" offset="64"/>
  <Field id="_35" name="reg_save_area" type="_38" context="_26" access="public" offset="128"/>
  <ArrayType id="_36" min="0" max="9" type="_27"/>
  <FundamentalType id="_37" name="unsigned int" size="32" align="32"/>
  <PointerType id="_38" type="_39" size="64" align="64"/>
  <FundamentalType id="_25" name="char" size="8" align="8"/>
  <FundamentalType id="_39" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="special_cases.h"/>
</CastXML>
